Feature: Вхід користувача
  Я хочу ввійти в аккаунт

  Scenario: Успішний вхід в аккаунт
    When Користувач знаходиться на сторінці входу
    Then Користувач вводить свої дані: "testmail@gmail.com" та "123456789A"
    Then Користувач натискає кнопку "Ввійти"
    Then Користувач повинен бачити головну сторінку


  Scenario: Неуспішний вхід в аккаунт
    When Користувач знаходиться на сторінці входу
    Then Користувач вводить свої дані: "aaaa.com" та "whynot234"
    Then Користувач натискає кнопку "Ввійти"
    Then Користувач повинен бачити повідомлення про невдалий вхід